export type AppUpdate = {
  version: string;
  date: string;
  comments: string[];
};

export const updates = [
  {
    version: '2.2.0',
    date: '2026/10/24 (土)',
    comments: [
      '視聴中のアイコンをテレビにし、ユーザー・履歴・設定の見出しにもアイコンを付けました。',
      '「視聴可能」の見出しを「現在配信中」に変更しました。',
      '各エピソードが放送まで何日何時間後かを表示するようにしました。',
      '評価済みのエピソードは、記録フォームの話数とタイトルを評価の色と太字で表示するようにしました。',
      '一覧の画像が一度にすべて取得してしまう不具合を直しました。',
      'アニメ詳細でエピソードを記録したあと、エピソード一覧へ反映されない不具合を直しました。',
      'プログレスバーが画面遷移の邪魔をしたり、戻るときに残り続ける不具合を直しました。',
      'エピソード記録を編集したとき、更新日時が出ない不具合を直しました。',
    ]
  },
  {
    version: '2.1.0',
    date: '2026/10/24 (土)',
    comments: [
      '視聴中の一覧画像を MyAnimeList の縦長画像にしました。詳細画面は横長画像のままです。',
      '視聴中の一覧と詳細画面で、視聴ステータスを色分けして表示するようにしました。',
      '視聴ステータスを未選択に戻せるようにし、並びを本家 Annict に合わせました。',
      'ページを移動するあいだ、画面上部にプログレスバーを表示するようにしました。',
    ]
  },
  {
    version: '2.0.0',
    date: '2026/10/23 (金)',
    comments: [
      '「視聴可能」と「週間予定」を「視聴中」にまとめて一つのページにしました。',
      'アニメ詳細から作品の記録ができるようになりました。',
      '設定の表示を「エピソード」と「記録」に分け、記録にも「他のユーザーの感想」と「みんなの評価」を追加しました。',
      'エピソード記録の「コメントなし」の表示を取りやめました。',
      'URLやタイトル、ローディング処理などいくつかの不具合を解消しました。',
    ]
  },
  {
    version: '1.12.0',
    date: '2026/10/21 (水)',
    comments: [
      'グローバルナビを「視聴可能・週間予定・ユーザー・履歴・設定」に変更しました。',
      '視聴可能と週間予定、ユーザー・履歴・設定をそれぞれ独立したページにしました。',
      '放送情報がない作品も「週間予定」の「放送情報なし」に表示するようにしました。',
      '今期の話数表示で、閑話・総集編などを対象外にするようにしました。',
      '視聴可能・週間予定に出す視聴ステータスを設定で選べるようにしました。',
      '読み込みパフォーマンスで最も影響が大きかった未視聴数の表示を取りやめました。',
    ]
  },
  {
    version: '1.11.1',
    date: '2026/10/20 (火)',
    comments: [
      '話数取得APIとキービジュアル取得API変更に対応しました。',
    ]
  },

  {
    version: '1.11.0',
    date: '2025/11/22 (土)',
    comments: [
      '記録画面にエピソードの前後リンクを付けました。',
      '記録画面がブラウザ履歴に対応しました。',
      '見てる・見たいのアニメ一覧で未視聴数を表示するようにしました。',
      '見た・一時中断・視聴中止のアニメ一覧は処理しないことにしました。'
    ]
  },
  {
    version: '1.10.0',
    date: '2025/11/19 (水)',
    comments: [
      '各アニメ詳細のエピソードにて、表記話数が前期を引き継ぐ場合、今期の話数を表記するようにしました。'
    ]
  },
  {
    version: '1.9.1',
    date: '2024/11/4 (月)',
    comments: [
      '設定ページから MyAnimeList のキャッシュを削除するボタンを作りました。何か不具合があればこちらを押してください。',
    ]
  },
  {
    version: '1.9.0',
    date: '2024/11/3 (日)',
    comments: [
      'ミュートページを設定ページに変更。他人の評価についての表示の設定を追加。',
      '通信を少なくするために MyAnimeList から取得する画像URLと全話数をローカルストレージへ保存するようにしました。',
      'エピソード記録画面でテキストエリアにフォーカスする動作をPCのみにしました。',
    ]
  },
  {
    version: '1.8.0',
    date: '2024/10/30 (水)',
    comments: [
      'ApolloClient のキャッシュ設定を最適化。',
      '作品画像が取得できない場合は MyAnimeList の画像を取得するようにしました。',
      'エピソード一覧にて全話数の表示を追加しました。',
      'エピソード記録時にみんなの評価が変動しない不具合を訂正。',
      'Annict のユーザーページへのリンクの設置場所をパネル内に移動しました。',
    ]
  },
  {
    version: '1.7.0',
    date: '2024/10/28 (月)',
    comments: [
      'マイページにプロフィールページを追加しました。',
    ]
  },
  {
    version: '1.6.0',
    date: '2024/10/26 (土)',
    comments: [
      'エピソード履歴に評価を表示しました。',
      'エピソード記録一覧を評価が良い順かつライクが多い順から表示するように変更しました。',
    ]
  },
  {
    version: '1.5.1',
    date: '2024/10/24 (木)',
    comments: [
      'エピソード記録画面でユーザーアイコン及び名前から Annict のユーザーページへのリンクを設置しました。',
    ]
  },
  {
    version: '1.5.0',
    date: '2024/10/23 (水)',
    comments: [
      'マイページ（エピソード履歴とミュート）を追加しました。',
      'エピソード記録画面でユーザーのミュートを行えるようにしました。',
    ]
  },
  {
    version: '1.4.0',
    date: '2024/10/21 (月)',
    comments: [
      'エピソード記録画面で評価を集計したみんなの評価を追加しました。',
    ]
  },
  {
    version: '1.3.0',
    date: '2024/10/20 (日)',
    comments: [
      'エピソード記録画面を開いた時に未記録の場合、テキストエリアにフォーカスするようにしました。',
      'エピソード記録画面で原作・監督・制作・キャストを表示するボタンを追加しました。',
    ]
  },
  {
    version: '1.2.1',
    date: '2023/06/12 (月)',
    comments: [
      'ホワイトモードの時に閲覧しにくい状況を回避しました。',
    ]
  },
  {
    version: '1.2.0',
    date: '2023/06/11 (日)',
    comments: [
      '原作、監督、制作の情報を表示できるようにしました。',
    ]
  },
  {
    version: '1.1.0',
    date: '2023/06/10 (土)',
    comments: [
      'キャスト情報を表示できるようにしました。',
      'エピソード記録の投稿時のツイッター連携は意味がないみたいなので削除しました。それにともなって自身の記録にシェアボタンを設置し、つぶやけるようにしました。',
      'エピソード記録画面からブラウザバックした際にスクロールが出来なくなる現象を解消しました。',
    ]
  },
  {
    version: '1.0.2',
    date: '2023/06/08 (木)',
    comments: [
      '詳細画面のチャンネルへのリンクが正確に取れないので名前だけ表示するようにしました。',
      '詳細画面をID指定で直接開いた場合かつ視聴ステータスが未選択でも表示されるようにしました。',
    ]
  },
  {
    version: '1.0.1',
    date: '2023/06/07 (水)',
    comments: [
      'エピソード記録の削除の際に確認を行うようにしました。',
      'コメントが入力されている際に離脱確認を行うようにしました。',
    ]
  },
  {
    version: '1.0.0',
    date: '2023/06/06 (火)',
    comments: [
      'リリースしました。',
    ]
  }
];

export const latestUpdate = updates[0];
